---
title: WallPaint
classe: Autodesk.Revit.DB.Visual.WallPaint
namespace: Autodesk.Revit.DB.Visual
eredita: System.Object
revit: "2025"
revitapi: "25.4.30.0"
stato: auto
verbo: leggere
membri_n: 5
---

# WallPaint

!!! note "Scheda automatica"
    La corrispondenza C#→Python è generata dalle 7 Regole. Descrizione, tranello ed esempio sono **da rivedere** — contribuisci.

## La classe

_(una frase: cos'è e a cosa serve)_

## La corrispondenza

| nella doc (C#) | in python | tipo |
|---|---|---|
| `String CommonTintColor { get; }` | `WallPaint.CommonTintColor` | String |
| `String CommonTintToggle { get; }` | `WallPaint.CommonTintToggle` | String |
| `String WallpaintApplication { get; }` | `WallPaint.WallpaintApplication` | String |
| `String WallpaintColor { get; }` | `WallPaint.WallpaintColor` | String |
| `String WallpaintFinish { get; }` | `WallPaint.WallpaintFinish` | String |

## Il tranello

_(ciò che la pagina non dice e ti farebbe sbagliare)_

## Lo script

```python
# esempio da completare
```